

# Менеджер задачи для недельного отчета
'''
Определение начальной даты анализа
Определение конечной даты анализа
Определение глубины анализа записи о помидорке (в текущей реализации - не глубже 3)
Определение вида представления
Определение локальных настроек с путями
Определение нормативного количества помидорок

Определение параметров представления
    полнота:
    - подробное - вся информация за каждый день
    - краткое - только обобщенные параметры
    - полное - краткое + полное
    
    способ вывода:
    - вывод на экран
    - вывод в json
    - вывод в markdown

Вызов определителя списка дат

Создание словаря для хранения результатов анализа

Вызов анализатора

Создание параметров представления

Вызов Менеджера визуализации
'''

# Менеджер задачи для проектного отчета

