'''
На визуализаторах можно потренировать наследование
'''

# визуализотор MarkDown
'''
Получает словарь с результатами
Получает путь до папки с результатами
Получает настройки полноты

Формирует текст заголовка
Формирует части в соответствии с настройками полноты
Объединяет части 
Сохраняет части в файл по пути
'''

# визуализотор JSON
'''
Получает словарь с результатами
Получает путь до папки с результатами
Получает настройки полноты

Отбирает необходимые части из словаря результатов
Сохраняет в JSON виде в нужный файл
'''

# визуализотор JSON
'''
Получает словарь с результатами
Получает путь до папки с результатами
Получает настройки полноты

Отбирает необходимые части из словаря результатов
Формирует текст заголовка
Формирует части в соответствии с настройками полноты для вывода экран
Объединяет части 
Выводит на экран
'''

# Менеджер визуализации
'''
Получает 
    настройки визуализации
    локальные пути
    словарь с результатами
Запускает визуализотор MarkDown
Запускает визуализотор JSON
Запускает визуализотор на экран
'''